app/Modules/Client/Controllers/DashboardController.php

    public function getAllDeviceData()
    {
        $clientId = $this->request->getGet('client_id');
        $userId = $this->request->getGet('user_id');
        $schemaName = 'client_' . $clientId;

        // Fetch device IDs assigned to the user from device_details table
        $deviceIdsQuery = $this->db->table('master.device_details')
                                    ->select('device_id')
                                    ->where('user_id', $userId)
                                    ->get();
---
SELECT "device_id"
FROM "master"."device_details"
WHERE "user_id" = '70'