app/Modules/Superadmin/Models/createUserModel.php

INSERT INTO "master"."role_list" ("can_view", "can_create", "can_delete", "can_edit", "can_adjust") VALUES (FALSE, FALSE, FALSE, FALSE, FALSE)
---
    public function addRole($data)
    {
        $roleData = [
            'can_view' => $data['can_view'],
            'can_create' => $data['can_create'],
            'can_delete' => $data['can_delete'],
            'can_edit' => $data['can_edit'],
        ];

        // Insert role data into the role_list table
        $roleInsertResult = $this->db->table('master.role_list')->insert($roleData);

SELECT "user_login".*, STRING_AGG(user_role.role_details::text, ', ') AS role_details
FROM "master"."user_login"
LEFT JOIN "master"."user_role" ON "user_role"."user_id" = "user_login"."id"
GROUP BY "user_login"."id"
---
    public function getUsersWithRoleDetails()
    {
        return $this->db->table('master.user_login')
            ->select('user_login.*, STRING_AGG(user_role.role_details::text, \', \') AS role_details')
            ->join('master.user_role', 'user_role.user_id = user_login.id', 'left')
            ->groupBy('user_login.id')
            ->get()
            ->getResult();