app/Modules/Superadmin/Models/createClientModel.php

SELECT "master"."client_details"."id", "master"."client_details"."client_name", "client_role"."role_details"
FROM "master"."client_details"
LEFT JOIN "master"."client_role" ON "client_role"."client_id" = "master"."client_details"."id"
---
    public function getClientWithRoleDetails()
{
    // Fetch all clients along with their role details
    $query = $this->db->table('master.client_details')
        ->select('master.client_details.id, master.client_details.client_name, client_role.role_details')
        ->join('master.client_role', 'client_role.client_id = master.client_details.id', 'left')
        ->get();

    return $query->getResultArray();

SELECT "id", "device_name"
FROM "master"."device"
WHERE "client_id" = '137'
---
    public function getDevicesByClientId($clientId)
    {
        // Query to fetch devices based on client ID
        $query = $this->db->table('master.device')
            ->select('id, device_name')
            ->where('client_id', $clientId)
            ->get();

        return $query->getResultArray();